# Find Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceIntersector..::..Find Method
ReferenceIntersector Class See Also
---
Projects a ray from the origin along the given direction, and returns all references from intersected elements which match the ReferenceIntersector's criteria.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<ReferenceWithContext> Find(
	XYZ origin,
	XYZ direction
)
```

Visual Basic
---
```text
Public Function Find ( _
	origin As XYZ, _
	direction As XYZ _
) As IList(Of ReferenceWithContext)
```

Visual C++
---
```text
public:
IList<ReferenceWithContext^>^ Find(
	XYZ^ origin,
	XYZ^ direction
)
```

# ### Parameters
origin
    Type: Autodesk.Revit.DB..::..XYZ The origin of the ray.
direction
    Type: Autodesk.Revit.DB..::..XYZ The direction of the ray.
# ### Return Value
A collection containing the intersected references.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ReferenceIntersector Class
Autodesk.Revit.DB Namespace